website/app/Models/InputAspirasiModel.php

    public function getHistoriSiswa($nis)
    {
        return $this->select('input_aspirasi.*, kategori.ket_kategori as kategori, aspirasi.status, aspirasi.feedback')
            ->join('kategori', 'kategori.id_kategori = input_aspirasi.id_kategori')
            ->join('aspirasi', 'aspirasi.id_pelaporan = input_aspirasi.id_pelaporan', 'left')
            ->where('input_aspirasi.nis', $nis)
            ->orderBy('input_aspirasi.id_pelaporan', 'DESC')
            ->findAll();
---
SELECT `input_aspirasi`.*, `kategori`.`ket_kategori` as `kategori`, `aspirasi`.`status`, `aspirasi`.`feedback`
FROM `input_aspirasi`
JOIN `kategori` ON `kategori`.`id_kategori` = `input_aspirasi`.`id_kategori`
LEFT JOIN `aspirasi` ON `aspirasi`.`id_pelaporan` = `input_aspirasi`.`id_pelaporan`
WHERE `input_aspirasi`.`nis` = '1103'
ORDER BY `input_aspirasi`.`id_pelaporan` DESC