website/app/Controllers/Admin.php

    public function index()
    {
        $model = new InputAspirasiModel();
        $katModel = new \App\Models\KategoriModel();

        // Ambil input filter
        $filters = [
            'nis'      => $this->request->getGet('nis'),
            'kategori' => $this->request->getGet('kategori'),
            'status'   => $this->request->getGet('status'),
            'tanggal'  => $this->request->getGet('tanggal'),
        ];

        // Panggil fungsi dari Model
        $data['laporan'] = $model->getFilteredData(
            $filters['nis'],
            $filters['kategori'],
            $filters['status'],
            $filters['tanggal']
        )->paginate(10, 'laporan');

        $data['pager']    = $model->pager;
        $data['kategori'] = $katModel->findAll();
---
SELECT *
FROM `kategori`

    public function simpan_tanggapan()
    {

        $aspirasiModel = new \App\Models\AspirasiModel();
        $id_pelaporan = $this->request->getPost('id_pelaporan');

        $dataSimpan = [
            'id_pelaporan' => $id_pelaporan,
            'id_kategori'  => $this->request->getPost('id_kategori'),
            'feedback'     => $this->request->getPost('feedback'),
            'status'       => $this->request->getPost('status'),
        ];

        // Cek apakah ini sudah pernah ditanggapi
        $cek = $aspirasiModel->where('id_pelaporan', $id_pelaporan)->first();

        if ($cek) {

            $aspirasiModel->update($cek['id_aspirasi'], $dataSimpan);
---
SELECT *
FROM `aspirasi`
WHERE `id_pelaporan` = '7'
 LIMIT 1
UPDATE `aspirasi` SET `id_pelaporan` = '7', `id_kategori` = '4', `feedback` = 'sudah diperbaiki', `status` = 'Selesai'
WHERE `aspirasi`.`id_aspirasi` IN ('7')