website/app/Controllers/Auth.php

    public function proses_login()
    {
        $model = new AdminModel();
        $user  = $this->request->getPost('username');
        $pass  = $this->request->getPost('password');

        $dataAdmin = $model->where('username', $user)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin '
 LIMIT 1

    public function proses_login_siswa()
    {
        $model = new \App\Models\SiswaModel();
        $nis   = $this->request->getPost('nis');
        $kelas = $this->request->getPost('kelas');

        $dataSiswa = $model->where([
            'nis'   => $nis,
            'kelas' => $kelas
        ])->first();
---
SELECT *
FROM `siswa`
WHERE `nis` = '1103'
AND `kelas` = 'XII DKV'
 LIMIT 1