website/app/Controllers/Siswa.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $model = new InputAspirasiModel();
        $katModel = new KategoriModel();

        $nis = session()->get('nis');

        // memanggil funsi model
        $data['aspirasi'] = $model->getHistoriSiswa($nis);
        $data['kategori'] = $katModel->findAll();

INSERT INTO `input_aspirasi` (`nis`, `id_kategori`, `lokasi`, `ket`) VALUES ('12345', '3', 'bengkel KR', 'dsjfusgfusdfbdsuguwgfjsbdhfhuhdjbvjbfvjhdfgbdfhbvudfgjgjdfhgdfhvjfhfvufdhvjf')
INSERT INTO `aspirasi` (`id_pelaporan`, `id_kategori`, `feedback`, `status`) VALUES (48, '3', '-', 'Menunggu')
---
    public function simpan()
    {
        $modelInput = new InputAspirasiModel();
        $modelAspirasi = new \App\Models\AspirasiModel();

        $dataInput = [
            'nis'         => session()->get('nis'),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'lokasi'      => $this->request->getPost('lokasi'),
            'ket'         => $this->request->getPost('ket'),
        ];

        // Simpan ke tabel input_aspirasi
        $modelInput->save($dataInput);

        $id_pelaporan = $modelInput->insertID();
        $modelAspirasi->save([
            'id_pelaporan' => $id_pelaporan,
            'id_kategori'  => $this->request->getPost('id_kategori'),
            'feedback'     => '-',        // Belum ada feedback
            'status'       => 'Menunggu' // Status default saat pertama lapor
        ]);