website/app/Controllers/SiswaAdmin.php

    public function index()
    {
        // FILTER NAMA/NIS
        $cari = $this->request->getGet('cari');
        if ($cari) {
            $this->siswaModel->like('nama', $cari)
                ->orLike('nis', $cari);
        }

        $data = [
            'title' => 'Manajemen Siswa',
            'siswa' => $this->siswaModel->findAll(),
---
SELECT *
FROM `siswa`